MikroElektronika/core_packages/PIC/XC8/def/PIC12F1571/mcu.h
// Register: PWM3PRL
#define PWM3PRL PWM3PRL
extern volatile unsigned char           PWM3PRL             __at(0xDB5);
#ifndef _LIB_BUILD
asm("PWM3PRL equ 0DB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM3PRL0               :1;
        unsigned PWM3PRL1               :1;
        unsigned PWM3PRL2               :1;
        unsigned PWM3PRL3               :1;
        unsigned PWM3PRL4               :1;
        unsigned PWM3PRL5               :1;
        unsigned PWM3PRL6               :1;
        unsigned PWM3PRL7               :1;
    };
    struct {
        unsigned PWM3PRL                :8;
    };
} PWM3PRLbits_t;
extern volatile PWM3PRLbits_t PWM3PRLbits __at(0xDB5);
// bitfield macros
#define _PWM3PRL_PR_POSN                                    0x0
#define _PWM3PRL_PR_POSITION                                0x0
#define _PWM3PRL_PR_SIZE                                    0x8
#define _PWM3PRL_PR_LENGTH                                  0x8
#define _PWM3PRL_PR_MASK                                    0xFF
#define _PWM3PRL_PWM3PRL0_POSN                              0x0
#define _PWM3PRL_PWM3PRL0_POSITION                          0x0
#define _PWM3PRL_PWM3PRL0_SIZE                              0x1
#define _PWM3PRL_PWM3PRL0_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL0_MASK                              0x1
#define _PWM3PRL_PWM3PRL1_POSN                              0x1
#define _PWM3PRL_PWM3PRL1_POSITION                          0x1
#define _PWM3PRL_PWM3PRL1_SIZE                              0x1
#define _PWM3PRL_PWM3PRL1_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL1_MASK                              0x2
#define _PWM3PRL_PWM3PRL2_POSN                              0x2
#define _PWM3PRL_PWM3PRL2_POSITION                          0x2
#define _PWM3PRL_PWM3PRL2_SIZE                              0x1
#define _PWM3PRL_PWM3PRL2_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL2_MASK                              0x4
#define _PWM3PRL_PWM3PRL3_POSN                              0x3
#define _PWM3PRL_PWM3PRL3_POSITION                          0x3
#define _PWM3PRL_PWM3PRL3_SIZE                              0x1
#define _PWM3PRL_PWM3PRL3_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL3_MASK                              0x8
#define _PWM3PRL_PWM3PRL4_POSN                              0x4
#define _PWM3PRL_PWM3PRL4_POSITION                          0x4
#define _PWM3PRL_PWM3PRL4_SIZE                              0x1
#define _PWM3PRL_PWM3PRL4_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL4_MASK                              0x10
#define _PWM3PRL_PWM3PRL5_POSN                              0x5
#define _PWM3PRL_PWM3PRL5_POSITION                          0x5
#define _PWM3PRL_PWM3PRL5_SIZE                              0x1
#define _PWM3PRL_PWM3PRL5_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL5_MASK                              0x20
#define _PWM3PRL_PWM3PRL6_POSN                              0x6
#define _PWM3PRL_PWM3PRL6_POSITION                          0x6
#define _PWM3PRL_PWM3PRL6_SIZE                              0x1
#define _PWM3PRL_PWM3PRL6_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL6_MASK                              0x40
#define _PWM3PRL_PWM3PRL7_POSN                              0x7
#define _PWM3PRL_PWM3PRL7_POSITION                          0x7
#define _PWM3PRL_PWM3PRL7_SIZE                              0x1
#define _PWM3PRL_PWM3PRL7_LENGTH                            0x1
#define _PWM3PRL_PWM3PRL7_MASK                              0x80
#define _PWM3PRL_PWM3PRL_POSN                               0x0
#define _PWM3PRL_PWM3PRL_POSITION                           0x0
#define _PWM3PRL_PWM3PRL_SIZE                               0x8
#define _PWM3PRL_PWM3PRL_LENGTH                             0x8
#define _PWM3PRL_PWM3PRL_MASK                               0xFF

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
extern volatile unsigned char           PWM3PRH             __at(0xDB6);
#ifndef _LIB_BUILD
asm("PWM3PRH equ 0DB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM3PRH0               :1;
        unsigned PWM3PRH1               :1;
        unsigned PWM3PRH2               :1;
        unsigned PWM3PRH3               :1;
        unsigned PWM3PRH4               :1;
        unsigned PWM3PRH5               :1;
        unsigned PWM3PRH6               :1;
        unsigned PWM3PRH7               :1;
    };
    struct {
        unsigned PWM3PRH                :8;
    };
} PWM3PRHbits_t;
extern volatile PWM3PRHbits_t PWM3PRHbits __at(0xDB6);
// bitfield macros
#define _PWM3PRH_PR_POSN                                    0x0
#define _PWM3PRH_PR_POSITION                                0x0
#define _PWM3PRH_PR_SIZE                                    0x8
#define _PWM3PRH_PR_LENGTH                                  0x8
#define _PWM3PRH_PR_MASK                                    0xFF
#define _PWM3PRH_PWM3PRH0_POSN                              0x0
#define _PWM3PRH_PWM3PRH0_POSITION                          0x0
#define _PWM3PRH_PWM3PRH0_SIZE                              0x1
#define _PWM3PRH_PWM3PRH0_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH0_MASK                              0x1
#define _PWM3PRH_PWM3PRH1_POSN                              0x1
#define _PWM3PRH_PWM3PRH1_POSITION                          0x1
#define _PWM3PRH_PWM3PRH1_SIZE                              0x1
#define _PWM3PRH_PWM3PRH1_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH1_MASK                              0x2
#define _PWM3PRH_PWM3PRH2_POSN                              0x2
#define _PWM3PRH_PWM3PRH2_POSITION                          0x2
#define _PWM3PRH_PWM3PRH2_SIZE                              0x1
#define _PWM3PRH_PWM3PRH2_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH2_MASK                              0x4
#define _PWM3PRH_PWM3PRH3_POSN                              0x3
#define _PWM3PRH_PWM3PRH3_POSITION                          0x3
#define _PWM3PRH_PWM3PRH3_SIZE                              0x1
#define _PWM3PRH_PWM3PRH3_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH3_MASK                              0x8
#define _PWM3PRH_PWM3PRH4_POSN                              0x4
#define _PWM3PRH_PWM3PRH4_POSITION                          0x4
#define _PWM3PRH_PWM3PRH4_SIZE                              0x1
#define _PWM3PRH_PWM3PRH4_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH4_MASK                              0x10
#define _PWM3PRH_PWM3PRH5_POSN                              0x5
#define _PWM3PRH_PWM3PRH5_POSITION                          0x5
#define _PWM3PRH_PWM3PRH5_SIZE                              0x1
#define _PWM3PRH_PWM3PRH5_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH5_MASK                              0x20
#define _PWM3PRH_PWM3PRH6_POSN                              0x6
#define _PWM3PRH_PWM3PRH6_POSITION                          0x6
#define _PWM3PRH_PWM3PRH6_SIZE                              0x1
#define _PWM3PRH_PWM3PRH6_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH6_MASK                              0x40
#define _PWM3PRH_PWM3PRH7_POSN                              0x7
#define _PWM3PRH_PWM3PRH7_POSITION                          0x7
#define _PWM3PRH_PWM3PRH7_SIZE                              0x1
#define _PWM3PRH_PWM3PRH7_LENGTH                            0x1
#define _PWM3PRH_PWM3PRH7_MASK                              0x80
#define _PWM3PRH_PWM3PRH_POSN                               0x0
#define _PWM3PRH_PWM3PRH_POSITION                           0x0
#define _PWM3PRH_PWM3PRH_SIZE                               0x8
#define _PWM3PRH_PWM3PRH_LENGTH                             0x8
#define _PWM3PRH_PWM3PRH_MASK                               0xFF

// Register: PWM3OF
#define PWM3OF PWM3OF
extern volatile unsigned short          PWM3OF              __at(0xDB7);
#ifndef _LIB_BUILD
asm("PWM3OF equ 0DB7h");
#endif

